Revit 2027 API
FabricationConfiguration.GetPartStatusDescription Method
 Gets the status description from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetPartStatusDescription(
	int statusId
)
Public Function GetPartStatusDescription (
	statusId As Integer
) As String
public:
String^ GetPartStatusDescription(
	int statusId
)
member GetPartStatusDescription :
        statusId : int -> string
Parameters
statusId Int32
 The status identifier.
Return Value
String
 The status description.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace